       program-id. Program1 as "Main.Program1".

       data division.

       working-storage section.
       01 NUMEROS.
           05 NUM1     PIC 9(10).
           05 NUM2     PIC 9(10).

       procedure division.


           goback.
           
       end program Program1.
